# Задание 1
print('Привет, Мир!')

# Задание 2
print('Виталий')
print('Носов')
print(46)

# Задание 3
print("В магазине 'Фрукты' сегодня скидка на \"яблоки\"!")

# Задание 4
print(10, 20)

# Задание 5
print()
print('начало')
print('конец')