# Задание 1
name = input('Введите имя: ')
print('Привет,', name)

# Задание 2
city = input('Город: ')
hobby = input('Хобби: ')
print('Я живу в городе', city, 'и люблю', hobby)

# Задание 3
first_name = input('Первое имя: ')
second_name = input('Второе имя: ')
third_name = input('Третье имя: ')

print(third_name)
print(second_name)
print(first_name)

# Задание 4
dish = input('Блюдо: ')
dessert = input('Десерт: ')
print("На обед у меня", dish, "а на десерт", dessert)